/*
 Navicat Premium Data Transfer

 Source Server         : ppp
 Source Server Type    : MySQL
 Source Server Version : 80023
 Source Host           : 121.4.82.48:3306
 Source Schema         : feedxin

 Target Server Type    : MySQL
 Target Server Version : 80023
 File Encoding         : 65001

 Date: 25/06/2021 10:47:36
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for result
-- ----------------------------
DROP TABLE IF EXISTS `result`;
CREATE TABLE `result` (
  `text_id` int NOT NULL AUTO_INCREMENT,
  `text_value1` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `text_value2` varchar(255) DEFAULT NULL,
  `text_value3` varchar(255) DEFAULT NULL,
  `text_value4` varchar(255) DEFAULT NULL,
  `user_id` int DEFAULT NULL,
  PRIMARY KEY (`text_id`)
) ENGINE=InnoDB AUTO_INCREMENT=226 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of result
-- ----------------------------
BEGIN;
INSERT INTO `result` VALUES (97, '1', '1', '1', '1', 1930941);
INSERT INTO `result` VALUES (98, '其他条件相同时，波长越长，越易于戳中在轴线上的小球。', '其他条件相同时，频率对实验结果影响不大。', '其他条件相同时，线密度越大，越易于戳中球。', '其他条件相同时 张力越大，越易于戳中小球', 2051867);
INSERT INTO `result` VALUES (99, '其他条件不变，波长越大，驻波越长。', '频率对驻波能否戳破小球没有影响', '线密度越大，驻波越密。', '张力越大，驻波越密', 2054197);
INSERT INTO `result` VALUES (100, '波长越长，能同时戳破的小球越多。', '频率不同，能同时戳破的小球个数也不同。', '线密度越大，可戳破小球的密度越大。', '张力越大，戳破小球的速度越大。', 2052071);
INSERT INTO `result` VALUES (101, '两个气球间的距离必须是波长整数倍', '频率与实验结果无关', '线密度越大，越容易戳破', '张力越大越容易戳破', 2050307);
INSERT INTO `result` VALUES (102, '其他条件不变时，波长越长，有利于波峰戳破小球。', '其他条件不变时，频率越高，有利于波峰戳破小球。', '其他条件不变时，线密度越小，有利于波峰戳破小球。', '其他条件不变时，张力越大，有利于波峰戳破小球。', 2051239);
INSERT INTO `result` VALUES (103, '波长越长，横向范围越大', '频率越大，同一段内波峰越多', '线密度越小，波越密', '张力越大，波峰越大', 2050775);
INSERT INTO `result` VALUES (104, '波长越长，可以戳破更远的小球', '频率越高，戳的越密集', '无影响', '无影响', 2053309);
INSERT INTO `result` VALUES (105, '波长越长，周期个数越多', '频率越大，周期越小', '线密度越大，周期越大', '张力越大，周期越小', 2050822);
INSERT INTO `result` VALUES (106, '会导致波更长，过短则无法接触小球', '频率越高，周期越小，更易戳破', '线密度越大，越易戳破小球', '更易戳破小球', 2053310);
INSERT INTO `result` VALUES (107, '波长越长，驻波运动距离越远', '频率越大，驻波振动越快', '线密度越大，驻波波数越少', '张力越大，驻波波数越少', 2050508);
INSERT INTO `result` VALUES (108, 'q', 'q', 'q', 'q', 11);
INSERT INTO `result` VALUES (109, '波长越短实验越容易成功', '频率越大波长越短', '线密度越越大波长越短', '张力越小 波长越短', 2051144);
INSERT INTO `result` VALUES (110, '波长越大实验越容易成功', '频率与波长成反比', '线密度越大频率越大', '张力越大波长越短', 2051534);
INSERT INTO `result` VALUES (111, '无影响', '正相关', '正相关', '正相关', 2053100);
INSERT INTO `result` VALUES (112, '波长越大越不易同时戳破小球', '频率越大，波长越小', '线密度越大，波长越小', '张力与波长无关', 2050709);
INSERT INTO `result` VALUES (113, '波长越大，实验中波能碰到的小球位置越高', '频率越大，波长越短', '线密度越大，波长越大', '张力越大，波长越大', 2050776);
INSERT INTO `result` VALUES (114, '波长越大，越易打到小球', '反比', '线密度与波长成正比', '张力越大，波长越短', 2052099);
INSERT INTO `result` VALUES (115, '波长越长，结果不好', '成反比', '线密度与波长成正比', '张力与波长成正比', 2050542);
INSERT INTO `result` VALUES (116, '波长减小，小球会被戳破', '增加频率，波长减小', '线密度增大，波长增大', '张力增大，波长增大', 2051188);
INSERT INTO `result` VALUES (117, '波长会影响驻波的振幅', '在线密度和张力不变的情况下，波长与频率成反比', '在频率和张力不变的情况下，波长与线密度的开平方成反比', '在频率和线密度不变的情况下，波长与张力成正比', 2053708);
INSERT INTO `result` VALUES (118, '其他条件不变，波长越短，同时戳破气球的概率越大；波长越长，同时戳破气球的概率越低', '其他条件不变，频率越大，波长越短', '其他条件不变，线密度越大，波长越短', '其他条件不变，张力越大，波长越长', 2050673);
INSERT INTO `result` VALUES (119, '当两小球间距离是波长的整数倍时，波可以把两个小球同时戳破。', '波长等于波速除以频率，波速不变时，波长与频率成反比。', '线密度越大，波长越小。', '张力越大，波长越大。', 2052151);
INSERT INTO `result` VALUES (120, '波长是一定值才能同时戳破小球', '频率越大，波长越小', '线密度越大，波长越大', '张力越大，波长越大', 2051235);
INSERT INTO `result` VALUES (121, '需要足够的波长，才能戳破球，波长太长，无法与球接触。', '波长与频率成反比', '线密度不影响波长', '弦线上的张力越大，震动频率越高，波长变短', 2051748);
INSERT INTO `result` VALUES (122, '当放置两球间距为波长整数倍时，可以戳破气球', '控制其他变量不变，频率越大，波长越小', '控制其他变量不变，线密度越大，波长越小', '控制其他变量不变，张力越大，波长越大', 2050295);
INSERT INTO `result` VALUES (123, '波长在一定范围内越大，实验越容易成功', '频率越大，波长越小', '线密度越大，波长越小', '张力越大，波长越短', 2051780);
INSERT INTO `result` VALUES (124, '够长才能都戳到', '反比', '反比', '反比', 2051618);
INSERT INTO `result` VALUES (125, '波长影响波峰之间的距离，波长越长，距离越大', '波长与频率成反比', '线密度越小波长越长', '张力越大波长越长', 2051747);
INSERT INTO `result` VALUES (126, '波长越大，横向长度越长', '频率越大，震动越快', '线密度越大，波越稀疏', '张力越大，波越密', 2053653);
INSERT INTO `result` VALUES (127, '波长越长，波峰间距越大', '与波长倒数正相关', '与波长倒数正相关', '没有关系', 2051916);
INSERT INTO `result` VALUES (128, '波长越长，波峰越少，越不容易戳到小球', '频率和波长成负相关关系', '线密度越大，波长越短', '张力越大，波长越短', 2051043);
INSERT INTO `result` VALUES (129, '无', '频率与波长成反比', '线密度与波长成反比', '不知道', 2051300);
INSERT INTO `result` VALUES (130, '波长越长，越容易戳破气球', '频率和波长呈反比关系', '线密度对波长没有影响', '张力越小，波长越大', 2053932);
INSERT INTO `result` VALUES (131, '波长决定两个波峰之间的距离', '反比', '先密度越大，波长越短', '张力越大，波长越长', 2054343);
INSERT INTO `result` VALUES (132, '无影响\n', '反比', '反比', '正相关', 2052088);
INSERT INTO `result` VALUES (133, '小球球心间距为波长整数倍时可以同时戳破', '成反比', '成正比', '无关', 2051384);
INSERT INTO `result` VALUES (134, '只有当两个球之间的距离恰好是波长的整数倍时，两个球才会同时被戳破。', '频率和波长呈反比关系。', '线密度越高，波长越短。', '张力越大，波长越大。', 2056064);
INSERT INTO `result` VALUES (135, '只有当两个球之间的距离恰好是波长的整数倍时，两个球才会同时被戳破。', '频率和波长呈反比关系。', '线密度越高，波长越短。', '张力越大，波长越大。', 2056064);
INSERT INTO `result` VALUES (136, '波长的大小关系到波峰的位置。', '频率越高，波长越短。', '线密度与波长无关。', '张力越大，波长越短。', 2051752);
INSERT INTO `result` VALUES (137, '我认为波长与驻波能否戳破气球无关', '频率和波长应该时成反比的关系', '当其他条件不变时，线密度越大，波长越小', '当其他条件不变时，当张力越大，波长越长', 2050844);
INSERT INTO `result` VALUES (138, '波长越长，可以戳到更远的小球', '频率和波长成倒数关系', '线密度越大，波长越小', '张力越大，波长越小', 2052937);
INSERT INTO `result` VALUES (139, '波长越小，越容易让波击中球', '呈反比', '线密度越大，波长越长', '波长越长，张力越大', 2050769);
INSERT INTO `result` VALUES (140, '波长对实验结果影响不大', '频率与波长成正比关系', '线密度与波长成反比关系', '张力与波长成正比关系', 2051107);
INSERT INTO `result` VALUES (141, '两小球之间的距离应是波长的整数倍才能同时碰到小球', '成反比', '与线密度的二次根式成反比', '与张力的二次根式成正比', 2052034);
INSERT INTO `result` VALUES (142, '波长越大实验结果约不准确', '频率与波长成反比', '线密度与波长成反比', '张力与波长成反比', 2053229);
INSERT INTO `result` VALUES (143, '整数倍的波长等于小球之间的距离才能同时戳破。', '频率越高波长越小。', '线密度越大，波长越小。', '暂时还未发现张力和波长的关系。', 2053093);
INSERT INTO `result` VALUES (144, '波长大更好戳', '频率高更好戳', '线密度大更好戳', '张力小更好戳', 2052853);
INSERT INTO `result` VALUES (145, '波长越长，小球越难同时戳破', '频率越快，波长越短；频率越慢，波长越长。', '线密度越大，波长越短；线密度越小，波长越长。', '张力越大，波长越长；张力越小，波长越短。', 2052798);
INSERT INTO `result` VALUES (146, '两球之间的距离应为波长的整数倍，而且波长的设置要与墙壁与第一个球之间的距离有关，波长决定着波峰能否同时扎破小球。', '波长与频率成反比。', '线密度与波长成反比。', '波长与张力的平方成正比。', 2050512);
INSERT INTO `result` VALUES (147, '波长短将更容易达成目标', '频率越高，波长越短', '线密度越大，波长越小', '张力越小，波长越小', 2051911);
INSERT INTO `result` VALUES (148, '波长越长，频率越小，波峰扎破小球的可能越小', '频率与波长成反比，频率越大，波长越短', '线密度越大，波越密集，扎破小球的可能越大', '张力越大，频率越大，波长越短', 2050827);
INSERT INTO `result` VALUES (149, '波长增加，波峰更高', '频率增加，波长减小', '线密度增大，波长增大', '张力增大，波长增大', 2050519);
INSERT INTO `result` VALUES (150, '波长变化越大越容易戳破小球', '频率越大波变化越快', '线密度越大波长越大', '张力越大波长越长', 2050597);
INSERT INTO `result` VALUES (151, '波长将影响波峰横坐标位置，从而影响是否能同时戳破气球', '频率越大波长越短', '线密度越大，波长越短', '张力越大，波长越长', 2051356);
INSERT INTO `result` VALUES (152, '波长影响波形的位置与大小', '波长与频率成正比', '波长与线密度的平方成反比', '波长与张力的平方成正比', 2050676);
INSERT INTO `result` VALUES (153, '波长影响峰值的位置，从而影响是否能同时击破小球', '频率=1/波长', '线密度越大 波长越短', '其他条件不变 张力越大波长越长', 2052590);
INSERT INTO `result` VALUES (154, '波长越大，上下幅度越小', '频率越大，不影响上下幅度', '线密度不影响上下幅度', '张力越大，上下幅度越大', 2051643);
INSERT INTO `result` VALUES (155, '波长合适时才能戳破小球', '频率越大，波长越小', '线密度越大，波长越小', '张力越大，波长越大', 1950227);
INSERT INTO `result` VALUES (156, '波长越短越容易同时击破小球', '频率与波长无关', '线密度越大，波长越小；反之越大', '张力越大，波长越大；反之越小', 2050981);
INSERT INTO `result` VALUES (157, '影响到是否能同时戳破', '正比', '正比', '正比', 2050600);
INSERT INTO `result` VALUES (158, '波长不同，则波峰的位置不同，戳破的小球的位置不同', '频率越大，波长越短', '线密度越大，则波长越长', '引力越大，波长越长', 2050716);
INSERT INTO `result` VALUES (159, '波长合适时实验才能成功', '频率越大，波长越短', '线密度越大，波长越短', '张力越大，波长越长', 2051406);
INSERT INTO `result` VALUES (160, '波长越小越大', '频率越高波长越短', '线密度越大波长越短', '张力越小波长越大', 2051015);
INSERT INTO `result` VALUES (161, '波长不同会使能戳破小球的位置不同', '频率越大，波长越短', '线密度越大，波长越短', '张力越小，波长越短', 2051020);
INSERT INTO `result` VALUES (162, '波长影响频率，影响振速', '成反比', '线密度越大，波动周期越小', '张力影响波峰和波谷。张力越大，极值越大', 2051906);
INSERT INTO `result` VALUES (163, '波长可以影响波的频率等', '二者之间成反比', '二者正相关', '二者正相关（平方根成正比）', 2050634);
INSERT INTO `result` VALUES (164, '我不知道啊', '频率越高，波长越短', '线密度与波长无关', '张力越大，波长越短', 2052463);
INSERT INTO `result` VALUES (165, '越长越容易破', '越长越容易破', '越长越容易破', '越长越容易破', 2050293);
INSERT INTO `result` VALUES (166, '波长越长，越方便刺破小球', '频率越大，波长越长', '线密度越大，波长越短', '张力越大，波长越大', 2051332);
INSERT INTO `result` VALUES (167, '调整波长，波峰位置改变', '波速不变时，频率越大，波长越小', '波长越小线密度越大', '张力越大，波长越小', 2052351);
INSERT INTO `result` VALUES (168, '不同的波长对同一位置的小球有不同的戳破效果', '频率越大，波长运动越快', '线密度越大，波长越大', '张力越大，波长越大', 2053231);
INSERT INTO `result` VALUES (169, '波长影响波峰之间的距离', '频率影响波长的长短', '线密度影响波长', '张力影响波长', 2051760);
INSERT INTO `result` VALUES (170, '影响线的密集程度', '频率越高，波长越短', '线密度越高波长越短', '未观察出', 2051014);
INSERT INTO `result` VALUES (171, '1.波长越短波峰越容易戳到小球2.能同时戳到小球，两个小球的距离要是波长的整数倍', '频率越高，波长越短', '线密度越大，波长越短', '张力越大，波长越长', 2050728);
INSERT INTO `result` VALUES (172, '有影响', '频率越大波长越短', '线密度越大波长越长', '张力越大波长越长', 2053707);
INSERT INTO `result` VALUES (173, '波长的整数倍等于小球间距才能成功', '频率越大，波长越小', '线密度越大，波长越短', '张力越大，波长越长', 2050832);
INSERT INTO `result` VALUES (174, '波长整数倍等于小球间距才能成功', '频率越大，波长越小', '线密度越大，波长越短', '张力越大，波长越长', 2052056);
INSERT INTO `result` VALUES (175, '正比', '反比', '反比', '反比', 2050774);
INSERT INTO `result` VALUES (176, '波长越大，越容易', '频率越大，波长越小', '线密度越小，波长越小', '张力越大，波长越大', 2051439);
INSERT INTO `result` VALUES (177, '波长越小，越容易成功\n波长越大，越不容易成功', '频率越大，波长越小\n频率越小，波长越大', '线密度越大，越容易成功\n线密度越小，越不容易成功', '张力越小，越容易成功\n张力越大，越不容易成功', 2051338);
INSERT INTO `result` VALUES (178, '波长越大，越不容易戳破小球', '频率越高，波长越短', '线密度越大，波长越短', '张力和波长无明显关系', 2051016);
INSERT INTO `result` VALUES (179, '两小球之间的距离要等于波长的整数倍，小球才能被同时戳破', '频率与波长无关', '线密度越大，波长越小', '张力越小，波长越大', 2053706);
INSERT INTO `result` VALUES (180, '波长对实验结果无影响', '频率越大波长越短', '线密度与波长无关', '张力越大，波长越长', 2053933);
INSERT INTO `result` VALUES (181, '波长越短，越密集，戳破的气球越多', '频率与波长成正比', '线密度与波长成正比', '张力与波长成反比', 2051037);
INSERT INTO `result` VALUES (182, '一般来说，波长越小，即两个峰之间距离越小，越容易成功。', '频率越大，波长越小', '线密度越大，波长越小', '张力越大，波长越大', 2052487);
INSERT INTO `result` VALUES (183, '适合的波长才能成功', '随频率增大而减小', '随线密度增大而减小', '随张力增大而减小', 2051025);
INSERT INTO `result` VALUES (184, '正比', '正比', '正比', '正比', 2051308);
INSERT INTO `result` VALUES (185, '波长越长越难同时戳破', '频率越大波长越短', '线密度越大波长越大', '张力越大波长越大', 2052087);
INSERT INTO `result` VALUES (186, '正相关', '未得到', '无关', '负相关', 2051918);
INSERT INTO `result` VALUES (187, '波长越小越容易完成实验', '频率越大，波长越小', '线密度越大，波长越小', '张力越大，波长越大', 2050818);
INSERT INTO `result` VALUES (188, '波长越短，波越密集', '成反比', '线密度越大，波长越短', '张力越大，波长越长', 2050053);
INSERT INTO `result` VALUES (189, '波长合适才可以形成驻波', '波长与频率的关系是它们之间成反比', '其他条件不改变的情况下，线密度越大，波长越小', '其他条件不变的情况下，张力越大波长越长', 2050029);
INSERT INTO `result` VALUES (190, '只有当两小球之间的距离为n倍的波长是，才能同时戳破气球', '频率越高，波长越短', '线密度越高，波长越短', '张力越大，波长越长', 2050042);
INSERT INTO `result` VALUES (191, '波长越长，频率越低，波峰减少', '波长与频率成反比，即λ=u/f', '线密度和波长呈负相关，线密度越大，波长越小', ' 弦线上的张力越大,振动频率越高,波长变短.反之亦然', 2050901);
INSERT INTO `result` VALUES (192, '能够决定能否同时戳破气球', '频率和波长成反比', '线密度越大，波长越大', '张力越大，波长越小', 2050014);
INSERT INTO `result` VALUES (193, '波长越短实验成功\n', '频率越大波长越小', '线密度越大波长越长', '张力越大波长越长', 2051056);
INSERT INTO `result` VALUES (194, '波长决定了同时出现的波峰的位置。', '频率=1/波长', '线密度与波长成正比。', '张力的对数与波长的对数呈线性关系。', 2050022);
INSERT INTO `result` VALUES (195, '波长是小球最小间隔', '频率越高，波长越短', '波长越长，线密度越低', '波长越长，张力越大', 1653310);
INSERT INTO `result` VALUES (196, '波长是小球最小间隔', '频率越高，波长越短', '波长越长，线密度越低', '波长越长，张力越大', 1653310);
INSERT INTO `result` VALUES (197, '波长越短，越有可能成功。', '频率越小，波长越长。', '线密度越小，波长越短。', '张力越大，波长越长', 2050619);
INSERT INTO `result` VALUES (198, '波长越长，越难戳破小球', '频率越大，波长越小', '线密度越大，波长越小', '张力越大，波长越小', 2052285);
INSERT INTO `result` VALUES (199, '小球之间距离为波长整数倍时实验才能成功', '频率大小与波长大小成反比', '线密度大小与波长大小成正比', '张力大小与波长大小成正比', 2052046);
INSERT INTO `result` VALUES (200, '波长决定波峰的位置', '频率越大，波长越短', '线密度越大波长越短', '张力越大，波长越短', 2050023);
INSERT INTO `result` VALUES (201, '无关', '频率越大，波长越短', '无关', '无关', 2053704);
INSERT INTO `result` VALUES (202, '无关', '频率越大，波长越长', '线密度越大，波长越长', '张力越大，波长越短', 2053704);
INSERT INTO `result` VALUES (203, '波长影响最高峰位置。', '波长越长，频率越短。', '线密度越大，波长越大。', '张力越大，波长越大。', 2050030);
INSERT INTO `result` VALUES (204, '波长越小，越容易戳到球', '频率越大，波长越小', '线密度越小，波长越大', '张力越大，波长越大', 2050231);
INSERT INTO `result` VALUES (205, '波长越小，越容易过该实验', '频率越大，波长越小', '线密度越大，波长越小', '张力越大，波长越大', 2050036);
INSERT INTO `result` VALUES (206, '波长越小，越容易通过', '频率越大，波长越小', '线密度越大，波长越小', '张力越小，波长越小', 2053529);
INSERT INTO `result` VALUES (207, '波长越长小球越不易被同时刺破', '频率与波长成反比', '线密度与波长成正比', '张力与波长成反比', 2053321);
INSERT INTO `result` VALUES (208, '有影响', '正比', '相关', '相关', 2050011);
INSERT INTO `result` VALUES (209, '无', '无', '无', '无', 2050037);
INSERT INTO `result` VALUES (210, '波长的整数倍刚好为气球之间距离时成功', '频率越大波长越短', '线密度越大波长越短', '张力越小波长越长', 2050004);
INSERT INTO `result` VALUES (211, '波长合适才可以产生驻波', '频率与波长成反比关系', '线密度越大，波长越短；线密度越小，波长越长', '张力越大波长越长；张力越小波长越短', 2050021);
INSERT INTO `result` VALUES (212, '波长的大小影响能否同时戳破小球', '频率越大，波长越短', '线密度越大，波长越小', '张力越大，波长越大', 2050019);
INSERT INTO `result` VALUES (213, '正比', '反比', '反比', '正比', 2050013);
INSERT INTO `result` VALUES (214, '在本实验中，波长同时由频率、线密度与张力三个变量控制。', '其他条件不变时，频率与波长成反比。', '其他条件不变时，线密度与波长成反比。', '其他条件不变时，张力与波长成正比', 2050382);
INSERT INTO `result` VALUES (215, '波长越长，越容易碰到小球。', '驻波波长与频率成反比。', '线密度与波长无明显关系。', '张力越大，波长越长。', 2053354);
INSERT INTO `result` VALUES (216, '当两个球之间的距离为波长整数倍时，且球在波峰位置处，两个球能被同时戳破', '频率越大，波长越小，振幅越大', '线密度越大，波长越小', '张力越大，波长越大', 2050295);
INSERT INTO `result` VALUES (218, '波长的周期要是两个小球之间距离的倍数', '频率越大，波长越小', '线密度越大，波长越小', '张力越小，波长越小', 2050604);
INSERT INTO `result` VALUES (219, '未得出', '频率越大，波长不变', '线密度与波长负相关', '张力与波长正相关', 2051918);
INSERT INTO `result` VALUES (220, '没有影响', '频率越高，波长越小', '线密度越大，波长越短', '张力越大，波长越大', 2050028);
INSERT INTO `result` VALUES (221, '波长越小，实验越容易成功', '频率越大，波长越小', '线密度越大，波长越小', '张力越大，波长越小', 2050584);
INSERT INTO `result` VALUES (222, '波长的大小会影响波峰出现的位置。', '频率越大，波长越短。', '线密度越大，波长越短。', '张力越大，波长越大。', 2051752);
INSERT INTO `result` VALUES (223, '波长与屏幕上出现的小球间距是否对应，决定了两个小球能否同时被戳破。', 'v=λf,在波速一定时，频率与波长反比。', '线密度越大，波长越短。', '张力影响振幅而非波长。', 2050040);
INSERT INTO `result` VALUES (224, '波长不同周期不同使固定两点不一定能同时同时成为波峰', '成反比', '线密度越大波长越短', '张力越大波长越短', 2050418);
INSERT INTO `result` VALUES (225, '波长越短越易戳破小球', '频率越大越易戳破小球', '线密度越大越易戳破小球', '张力越小越易戳破小球', 2050010);
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
